New Verticle/Simplita.ai/Testing/Performance Testing/Script/Basic_FLow_Smplita-Combined-JMeter-and-Selenium.YAML

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Basic FLow_Smplita-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Basic FLow_Smplita-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Basic FLow_Smplita-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,945)
      - go(https://demo.simplita.ai/auth)
      - waitForCSS(form > .text-white): "Clickable"
      - clickByCSS(form > .text-white)
      - waitForCSS(form > .text-white): "Clickable"
      - clickByCSS(form > .text-white)
      - waitForCSS(div.flex.items-start.space-x-4): "Clickable"
      - clickByCSS(div.flex.items-start.space-x-4)
      - waitForID(projectName): "Clickable"
      - clickByID(projectName)
      - waitForID(projectName): "Clickable"
      - typeByID(projectName): "Test01"
      - waitForCSS(.justify-end > .text-white): "Clickable"
      - clickByCSS(.justify-end > .text-white)
      - waitForCSS(button.flex-1.py-2.px-3.flex.justify-center.items-center.text-gray-500 > span.text-xs): "Clickable"
      - clickByCSS(button.flex-1.py-2.px-3.flex.justify-center.items-center.text-gray-500 > span.text-xs)
      - waitForCSS(span.text-xs): "Clickable"
      - clickByCSS(span.text-xs)
      - 'waitForCSS(div:nth-of-type(3) > .flex > .flex > .font-medium)': "Clickable"
      - 'clickByCSS(div:nth-of-type(3) > .flex > .flex > .font-medium)'
      - 'waitForCSS(div:nth-of-type(5) > .flex-col)': "Clickable"
      - 'clickByCSS(div:nth-of-type(5) > .flex-col)'
      - 'waitForCSS(div:nth-of-type(4) > .flex > .flex > .font-medium)': "Clickable"
      - 'clickByCSS(div:nth-of-type(4) > .flex > .flex > .font-medium)'
      - 'waitForCSS(div:nth-of-type(4) > .flex > .flex > .font-medium)': "Clickable"
      - 'clickByCSS(div:nth-of-type(4) > .flex > .flex > .font-medium)'
      - 'waitForCSS(div:nth-of-type(8) > .justify-between)': "Clickable"
      - 'clickByCSS(div:nth-of-type(8) > .justify-between)'
      - waitForCSS(main.flex-1.overflow-x-hidden > div.min-h-screen): "Clickable"
      - clickByCSS(main.flex-1.overflow-x-hidden > div.min-h-screen)
      - waitForCSS(span.text-lg.font-medium.text-gray-900): "Clickable"
      - clickByCSS(span.text-lg.font-medium.text-gray-900)
      - waitForCSS(.flex-col > div > .text-white): "Clickable"
      - clickByCSS(.flex-col > div > .text-white)
      - waitForCSS(.justify-end > .text-white): "Clickable"
      - clickByCSS(.justify-end > .text-white)

  Basic FLow_Smplita-Http:
    headers:
      sec-ch-ua-platform: '"Windows"'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      DNT: '1'
      sec-ch-ua-mobile: '?0'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://demoapi.simplita.ai/api/v1/auth/signup
            method: POST
            label: https://demoapi.simplita.ai/api/v1/auth/signup
            headers:
              Accept: application/json, text/plain, */*
              Content-Type: application/json
            body: '{"email":"lakshmaanan.m@qnqhealthcare.in","password":"Lak@2003"}'
          - url: https://demoapi.simplita.ai/api/v1/auth/login
            method: POST
            label: https://demoapi.simplita.ai/api/v1/auth/login
            headers:
              Accept: application/json, text/plain, */*
              Content-Type: application/json
            body: '{"email":"lakshmaanan.m@qnqhealthcare.in","password":"Lak@2003"}'
          - url: https://demo.simplita.ai/workspace
            method: GET
            label: https://demo.simplita.ai/workspace
            headers:
              RSC: '1'
              Next-Router-State-Tree: >-
                %5B%22%22%2C%7B%22children%22%3A%5B%22auth%22%2C%7B%22children%22%3A%5B%22__PAGE__%22%2C%7B%7D%5D%7D%5D%7D%2Cnull%2Cnull%2Ctrue%5D
              Next-Url: /auth
              Accept: '*/*'
            body:
              _rsc: woxvv
          - url: >-
              https://demoapi.simplita.ai/api/projects/user/c9c9d1cd-d653-4c4a-98f8-d6c7b18aabf7
            method: GET
            label: >-
              https://demoapi.simplita.ai/api/projects/user/c9c9d1cd-d653-4c4a-98f8-d6c7b18aabf7
            headers:
              Authorization: >-
                Bearer
                eyJhbGciOiJIUzI1NiIsImtpZCI6IjlpWmxia2dBdGpuRlFCbGEiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2tndnhpb3V2a3pndWd3a2prbXB3LnN1cGFiYXNlLmNvL2F1dGgvdjEiLCJzdWIiOiJjOWM5ZDFjZC1kNjUzLTRjNGEtOThmOC1kNmM3YjE4YWFiZjciLCJhdWQiOiJhdXRoZW50aWNhdGVkIiwiZXhwIjoxNzQyMjE1NDYzLCJpYXQiOjE3NDIyMTE4NjMsImVtYWlsIjoibGFrc2htYWFuYW4ubUBxbnFoZWFsdGhjYXJlLmluIiwicGhvbmUiOiIiLCJhcHBfbWV0YWRhdGEiOnsicHJvdmlkZXIiOiJlbWFpbCIsInByb3ZpZGVycyI6WyJlbWFpbCJdfSwidXNlcl9tZXRhZGF0YSI6eyJlbWFpbCI6Imxha3NobWFhbmFuLm1AcW5xaGVhbHRoY2FyZS5pbiIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJwaG9uZV92ZXJpZmllZCI6ZmFsc2UsInN1YiI6ImM5YzlkMWNkLWQ2NTMtNGM0YS05OGY4LWQ2YzdiMThhYWJmNyJ9LCJyb2xlIjoiYXV0aGVudGljYXRlZCIsImFhbCI6ImFhbDEiLCJhbXIiOlt7Im1ldGhvZCI6InBhc3N3b3JkIiwidGltZXN0YW1wIjoxNzQyMjExODYzfV0sInNlc3Npb25faWQiOiIxYjgxZmZjOS0yMmNjLTRiYzUtYjg3ZS0wNTQ1NjVjOWFhZGYiLCJpc19hbm9ueW1vdXMiOmZhbHNlfQ.cZSoOASblYX5q_nvP0nP2tyLw8jOE6USFoE8YsB-Ojg
              Accept: application/json, text/plain, */*
          - url: https://demo.simplita.ai/workspace
            method: GET
            label: https://demo.simplita.ai/workspace
            headers:
              RSC: '1'
              Next-Router-State-Tree: >-
                %5B%22%22%2C%7B%22children%22%3A%5B%22workspace%22%2C%7B%22children%22%3A%5B%22__PAGE__%22%2C%7B%7D%5D%7D%2Cnull%2Cnull%2Ctrue%5D%7D%2Cnull%2Cnull%2Ctrue%5D
              Next-Url: /workspace
              Accept: '*/*'
            body:
              _rsc: 1iv4p
          - url: >-
              https://events.launchdarkly.com/events/bulk/62913038bb88120c8d0102a7
            method: POST
            label: >-
              https://events.launchdarkly.com/events/bulk/62913038bb88120c8d0102a7
            headers:
              x-launchdarkly-event-schema: '3'
              x-launchdarkly-payload-id: 2ea1e300-0325-11f0-bd75-d39136bc8992
              content-type: application/json
              Accept: '*/*'
            body: >-
              [{"startDate":1742211867491,"endDate":1742211867491,"features":{"compose_extension.config.site_context_selectors":{"default":{"linkedin.com":{"paths":[{"sections":{"The
              education section includes the text":{"selector":"#profile-content
              > div > .pv-profile > div > div > main >
              section:nth-child(7)","weight":0.1},"The experience section
              includes the text":{"selector":"#profile-content > div >
              .pv-profile > div > div > main >
              section:nth-child(6)","weight":0.75},"The skills section includes
              the text":{"selector":"#profile-content > div > .pv-profile > div
              > div > main >
              section:nth-child(9)","weight":0.15}},"path_regex":"^/in/.+"}]}},"counters":[{"value":{"linkedin.com":{"paths":[{"path_regex":"^/in/.+","sections":{"The
              education section includes the text":{"selector":"#profile-content
              > div > .pv-profile > div > div > main >
              section:nth-child(7)","weight":0.1},"The experience section
              includes the text":{"selector":"#profile-content > div >
              .pv-profile > div > div > main >
              section:nth-child(6)","weight":0.75},"The skills section includes
              the text":{"selector":"#profile-content > div > .pv-profile > div
              > div > main >
              section:nth-child(9)","weight":0.15}}}]}},"count":1,"variation":0,"version":5}]}},"kind":"summary"}]
          - url: https://demoapi.simplita.ai/api/projects/createcard
            method: POST
            label: https://demoapi.simplita.ai/api/projects/createcard
            headers:
              Authorization: >-
                Bearer
                eyJhbGciOiJIUzI1NiIsImtpZCI6IjlpWmxia2dBdGpuRlFCbGEiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2tndnhpb3V2a3pndWd3a2prbXB3LnN1cGFiYXNlLmNvL2F1dGgvdjEiLCJzdWIiOiJjOWM5ZDFjZC1kNjUzLTRjNGEtOThmOC1kNmM3YjE4YWFiZjciLCJhdWQiOiJhdXRoZW50aWNhdGVkIiwiZXhwIjoxNzQyMjE1NDYzLCJpYXQiOjE3NDIyMTE4NjMsImVtYWlsIjoibGFrc2htYWFuYW4ubUBxbnFoZWFsdGhjYXJlLmluIiwicGhvbmUiOiIiLCJhcHBfbWV0YWRhdGEiOnsicHJvdmlkZXIiOiJlbWFpbCIsInByb3ZpZGVycyI6WyJlbWFpbCJdfSwidXNlcl9tZXRhZGF0YSI6eyJlbWFpbCI6Imxha3NobWFhbmFuLm1AcW5xaGVhbHRoY2FyZS5pbiIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJwaG9uZV92ZXJpZmllZCI6ZmFsc2UsInN1YiI6ImM5YzlkMWNkLWQ2NTMtNGM0YS05OGY4LWQ2YzdiMThhYWJmNyJ9LCJyb2xlIjoiYXV0aGVudGljYXRlZCIsImFhbCI6ImFhbDEiLCJhbXIiOlt7Im1ldGhvZCI6InBhc3N3b3JkIiwidGltZXN0YW1wIjoxNzQyMjExODYzfV0sInNlc3Npb25faWQiOiIxYjgxZmZjOS0yMmNjLTRiYzUtYjg3ZS0wNTQ1NjVjOWFhZGYiLCJpc19hbm9ueW1vdXMiOmZhbHNlfQ.cZSoOASblYX5q_nvP0nP2tyLw8jOE6USFoE8YsB-Ojg
              Accept: application/json, text/plain, */*
              Content-Type: application/json
            body: >-
              {"name":"Test01","status":"active","user_id":"c9c9d1cd-d653-4c4a-98f8-d6c7b18aabf7","created_at":"2025-03-17T11:44:31.904Z","updated_at":"2025-03-17T11:44:31.904Z","app_type":"default","needs_auth":false,"auth_type":"none","description":"Default
              project","storage_bucket":"default","storage_path":"default","files":[]}
          - url: >-
              https://demoapi.simplita.ai/api/projects/user/c9c9d1cd-d653-4c4a-98f8-d6c7b18aabf7
            method: GET
            label: >-
              https://demoapi.simplita.ai/api/projects/user/c9c9d1cd-d653-4c4a-98f8-d6c7b18aabf7
            headers:
              Authorization: >-
                Bearer
                eyJhbGciOiJIUzI1NiIsImtpZCI6IjlpWmxia2dBdGpuRlFCbGEiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2tndnhpb3V2a3pndWd3a2prbXB3LnN1cGFiYXNlLmNvL2F1dGgvdjEiLCJzdWIiOiJjOWM5ZDFjZC1kNjUzLTRjNGEtOThmOC1kNmM3YjE4YWFiZjciLCJhdWQiOiJhdXRoZW50aWNhdGVkIiwiZXhwIjoxNzQyMjE1NDYzLCJpYXQiOjE3NDIyMTE4NjMsImVtYWlsIjoibGFrc2htYWFuYW4ubUBxbnFoZWFsdGhjYXJlLmluIiwicGhvbmUiOiIiLCJhcHBfbWV0YWRhdGEiOnsicHJvdmlkZXIiOiJlbWFpbCIsInByb3ZpZGVycyI6WyJlbWFpbCJdfSwidXNlcl9tZXRhZGF0YSI6eyJlbWFpbCI6Imxha3NobWFhbmFuLm1AcW5xaGVhbHRoY2FyZS5pbiIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJwaG9uZV92ZXJpZmllZCI6ZmFsc2UsInN1YiI6ImM5YzlkMWNkLWQ2NTMtNGM0YS05OGY4LWQ2YzdiMThhYWJmNyJ9LCJyb2xlIjoiYXV0aGVudGljYXRlZCIsImFhbCI6ImFhbDEiLCJhbXIiOlt7Im1ldGhvZCI6InBhc3N3b3JkIiwidGltZXN0YW1wIjoxNzQyMjExODYzfV0sInNlc3Npb25faWQiOiIxYjgxZmZjOS0yMmNjLTRiYzUtYjg3ZS0wNTQ1NjVjOWFhZGYiLCJpc19hbm9ueW1vdXMiOmZhbHNlfQ.cZSoOASblYX5q_nvP0nP2tyLw8jOE6USFoE8YsB-Ojg
              Accept: application/json, text/plain, */*
          - url: https://demo.simplita.ai/editor
            method: GET
            label: https://demo.simplita.ai/editor
            headers:
              RSC: '1'
              Next-Router-Prefetch: '1'
              Next-Router-State-Tree: >-
                %5B%22%22%2C%7B%22children%22%3A%5B%22workspace%22%2C%7B%22children%22%3A%5B%22__PAGE__%22%2C%7B%7D%5D%7D%2Cnull%2Cnull%2Ctrue%5D%7D%2Cnull%2Cnull%2Ctrue%5D
              Next-Url: /workspace
              Accept: '*/*'
            body:
              _rsc: znp18
          - url: https://demoapi.simplita.ai/api/layouts/pages
            method: GET
            label: https://demoapi.simplita.ai/api/layouts/pages
            headers:
              Accept: '*/*'
            body:
              skip: '0'
              limit: '100'
              project_id: c867d95f-b9de-4b67-b177-4947a77146f6
          - url: https://demo.simplita.ai/workspace
            method: GET
            label: https://demo.simplita.ai/workspace
            headers:
              RSC: '1'
              Next-Router-Prefetch: '1'
              Next-Router-State-Tree: >-
                %5B%22%22%2C%7B%22children%22%3A%5B%22editor%22%2C%7B%22children%22%3A%5B%22__PAGE__%22%2C%7B%7D%5D%7D%5D%7D%2Cnull%2Cnull%2Ctrue%5D
              Next-Url: /editor
              Accept: '*/*'
            body:
              _rsc: f3cfm
          - url: >-
              https://demoapi.simplita.ai/api/projects/user/c9c9d1cd-d653-4c4a-98f8-d6c7b18aabf7
            method: GET
            label: >-
              https://demoapi.simplita.ai/api/projects/user/c9c9d1cd-d653-4c4a-98f8-d6c7b18aabf7
            headers:
              Authorization: >-
                Bearer
                eyJhbGciOiJIUzI1NiIsImtpZCI6IjlpWmxia2dBdGpuRlFCbGEiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2tndnhpb3V2a3pndWd3a2prbXB3LnN1cGFiYXNlLmNvL2F1dGgvdjEiLCJzdWIiOiJjOWM5ZDFjZC1kNjUzLTRjNGEtOThmOC1kNmM3YjE4YWFiZjciLCJhdWQiOiJhdXRoZW50aWNhdGVkIiwiZXhwIjoxNzQyMjE1NDYzLCJpYXQiOjE3NDIyMTE4NjMsImVtYWlsIjoibGFrc2htYWFuYW4ubUBxbnFoZWFsdGhjYXJlLmluIiwicGhvbmUiOiIiLCJhcHBfbWV0YWRhdGEiOnsicHJvdmlkZXIiOiJlbWFpbCIsInByb3ZpZGVycyI6WyJlbWFpbCJdfSwidXNlcl9tZXRhZGF0YSI6eyJlbWFpbCI6Imxha3NobWFhbmFuLm1AcW5xaGVhbHRoY2FyZS5pbiIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJwaG9uZV92ZXJpZmllZCI6ZmFsc2UsInN1YiI6ImM5YzlkMWNkLWQ2NTMtNGM0YS05OGY4LWQ2YzdiMThhYWJmNyJ9LCJyb2xlIjoiYXV0aGVudGljYXRlZCIsImFhbCI6ImFhbDEiLCJhbXIiOlt7Im1ldGhvZCI6InBhc3N3b3JkIiwidGltZXN0YW1wIjoxNzQyMjExODYzfV0sInNlc3Npb25faWQiOiIxYjgxZmZjOS0yMmNjLTRiYzUtYjg3ZS0wNTQ1NjVjOWFhZGYiLCJpc19hbm9ueW1vdXMiOmZhbHNlfQ.cZSoOASblYX5q_nvP0nP2tyLw8jOE6USFoE8YsB-Ojg
              Accept: application/json, text/plain, */*
          - url: https://demo.simplita.ai/auth
            method: GET
            label: https://demo.simplita.ai/auth
            headers:
              RSC: '1'
              Next-Router-Prefetch: '1'
              Next-Router-State-Tree: >-
                %5B%22%22%2C%7B%22children%22%3A%5B%22workspace%22%2C%7B%22children%22%3A%5B%22__PAGE__%22%2C%7B%7D%5D%7D%2Cnull%2Cnull%2Ctrue%5D%7D%2Cnull%2Cnull%2Ctrue%5D
              Next-Url: /workspace
              Accept: '*/*'
            body:
              _rsc: znp18